G.4 กิจกรรมท้ายการทดลอง
1. จงเปรียบเทียบการเรียกใช้ฟังค์ชัน printf และ scanf ในภาษา C จากการทดลองที่ 5 ภาคผนวก E กับ การทดลองนี้ด้านการส่งพารามิเตอร์
Answer การใช้ฟังค์ชัน printf เป็นการส่งพารามิเตอร์ผ่านตัวแปรเพื่อให้แสดงผลหน้าจอ Console แต่ scanf เป็นการส่งพารามิเตอร์ผ่านตัวแปรที่รับค่าผ่านทางแป้นพิมพ์
2. จงบอกความแตกต่างระหว่างการส่งค่าพารามิเตอร์แบบ Pass by Values และ Pass by Reference
Answer การส่งค่าพารามิเตอร์แบบ Pass by Values นั้นเป็นการส่งค่าผ่านตัวแปรปกติแต่การส่งค่าพารามิเตอร์แบบ Pass by Reference เป็นแบบเข้าไปยุ่งกับตำแหน่งด้วย



7. จงพัฒนาโปรแกรมด้วยภาษา Assembly เพื่อรับตัวเลขจำนวน 2 ตัวจากผู้ใช้ผ่านทางคีย์บอร์ด เรียกว่า
A และ B และแสดงผลลัพธ์ A หรือ B ที่มีค่ามากกว่าด้วยคำสั่งภาษาแอสเซมบลี

8. จงพัฒนาโปรแกรมด้วยภาษา Assembly เพื่อรับตัวเลขจำนวน 2 ตัวจากผู้ใช้ผ่านทางคีย์บอร์ด เรียกว่า
A และ B และแสดงผลลัพธ์ค่า A modulus B ซึ่งเท่ากับ ค่าเศษจากการคำนวณ A/B ด้วยคำสั่งภาษา
แอสเซมบลี

9. จงพัฒนาโปรแกรมด้วยภาษา Assembly เพื่อรับตัวเลขจำนวน 2 ตัวจากผู้ใช้ผ่านทางคีย์บอร์ด เรียกว่า
A และ B แล้วคำนวณหาค่า หารร่วมมาก (Greatest Common Divisor) หรือ หรม (GCD) ด้วยคำสั่ง
ภาษาแอสเซมบลีและแสดงผลลัพธ์ ตามตารางในข้อ 